{"pages":[],"posts":[{"title":"The Real Hello-World","text":"Actually this is the first time I use markdown, and this is just a test article to lear how to markdown. So…it would look kinda clumsy or dumb. Still have no idea how can I insert image into hexo articles. Well, since this is the first-ever blog of mine, I gotta write something down, right? Why did I wanted to start blogging? It’s pretty simple. I had some really great (I belive) ideas, and sometimes I solved some really difficult problems (for me, I need a place to store them so that they don’t disappear from my tiny brain. And bang, here we are! What IS this blog? For now, I’m planning to use my blog to recordm or save, my ideas in developpement, and some difficulties I’ve met during the process of developping (or using Arch Linux because everyday I get tons of them). And maybe, I say MAYBE, someday I would also add some kind of journal of my cycling training. What else do I wanna say ? To be honest, nothing. I’m not a guy who is good at talking, nor writing.So.. Welcome!Bienvenue !欢迎光临 !","link":"/2021/01/04/The-Real-Hello-World/"},{"title":"Pacman cannot update EFI-installed grub after upgrading kernel","text":"0. Problem Introduction I switched to Arch Linux from Ubuntu 2 weeks ago (that’s another story), so I’m a 100% noob in Arch Linux. One day, after I did my daily pacman -Syu, my system couldn’t boot anymore. It stucked in grub, and showed this: 12[FAILED] Failed to start load kernel modulesSee 'systemctl status systemd-modules-load.service** for details. Besides that, NOTHINGS else. 1. Problem Analysis So I did some research, unfortunately, nobody has occured such kind of problem, not in the English community, nor in the Chinese community. Normally, they would have another line of [FAILED] in the error, such as [FAILED]faild to mount /boot/efiAlso, I remembered that I have updated the kernel from 5.9 to 5.10, I guessed there was something to do with that.So I suggest the problem is just the kernel cannot be loaded, nothing else, no problem of mounting or other shits, which makes it actually more simple. 2. Solving The Problem I tried to follow the instruction that the system gave me, but since I cannot enter the system, I cannot use systemctl. So I entered into LiveCD (Luckily I have one in my hand), mounted the system, chroot, all good. I typed systemctl status systemd-modules-load.service, and I got: 1Running in chroot, ignoring status. After searching, I understanded that I cannot use systemctl inside chroot, due to a systemd feature. So I switched to another method. While I was in grub, I clicked ‘e’ to edit the booting command (temporarily editting grub.cfg), and added rescue at the end of the line in order to boot in to rescue mode: 1linux /boot/vmlinuz-linux root=UUID=14d44e03-023a-4c9a-8bd3-4e326116ac43 rw loglevel=3 rescue Luckily, I successfully booted into rescue mode. And I re-installed the already-uninstalled old kernel(5.9) with these commandes. 123456789101112#Enter the directory where the old packages are stored.cd /var/cache/pacman/pkg#Find old kernel version numberls | grep linux-headers#I got linux-headers-5.9.14.arch1-1-x86_64.pkg.tar.zst#list all related packagesls | grep 5.9.14#I got linux-5.9.14.arch1-1-x86_64.pkg.tar.zst and linux-headers-5.9.14.arch1-1-x86_64.pkg.tar.zst#Instally old kernel from local packagespacman -U linux-5.9.14.arch1-1-x86_64.pkg.tar.zst linux-headers-5.9.14.arch1-1-x86_64.pkg.tar.zst#reboot the systemreboot And the magic worked, I successfully entered the system. After that I did some tests, it turns out that once I upgrade the kernel, the same problem shows again. So, for further testing, I installed the lts kernel (which is more stable) by sudo pacman -S linux-lts. But the grub never showed the lts kernel option for me to boot, and after rebooting, uname -r still shows 5.9.14-arch-1-1, which means the installation has failed. I checked the pacman journal, updated grub by grub-mkconfig -o /boot/grub/grub.cfg, even manually checked several times that the grub.cfg is correct, all is well, but still nothing changed in the boot menu. So I doubted that there are two existing grub.cfg files, and pacman (and myself) is always updating the /boot/grub/grub.cfg, but the system is actually reading the other file. Then I realized that when I installed Arch Linux, I installed the grub in the EFI partition. Problem found. Now it’s time to solve it. 123456789101112131415sudo sufdisk -l #List all partitions#/dev/nvme1n1p1 2048 1085439 1083392 529M Environnement de récupération Windows#/dev/nvme1n1p2 1085440 1290239 204800 100M Système EFI#/dev/nvme1n1p3 1290240 1323007 32768 16M Réservé Microsoft#/dev/nvme1n1p4 1323008 417500934 416177927 198.4G Données de base Microsoft#/dev/nvme1n1p5 417501184 419088383 1587200 775M Environnement de récupération Windows#/dev/nvme1n1p6 419090432 500117503 81027072 38.6G Système de fichiers Linuxmkdir testmount /dev/nvme1n1p2 testgrub-mkconfig -o test/grub/grub.cfgumount /dev/nvme1n1p2reboot All done. After rebooting, grub menu shows additional kernels, and pacman upgrades the correct grub.cfg. 3. Summary After this not-so-good experience I realized that this happens because I lack tons of Linux basic knowledge, especially for Arch Linux. I don’t know how the grub work, I don’t know how the systemctl work, nor the chroot, I didn’t even remembered that I have installed the grub in EFI partition!Guess next time I’ll try to UNDERSTAND rather than USING a feature, a command, or an entire system.","link":"/2021/01/05/Pacman-cannot-update-EFI-installed-grub-after-upgrading-kernel/"}],"tags":[{"name":"Arch Linux","slug":"Arch-Linux","link":"/tags/Arch-Linux/"},{"name":"Issues","slug":"Issues","link":"/tags/Issues/"},{"name":"Personal","slug":"Personal","link":"/tags/Personal/"}],"categories":[{"name":"Arch Linux","slug":"Arch-Linux","link":"/categories/Arch-Linux/"},{"name":"Issues","slug":"Arch-Linux/Issues","link":"/categories/Arch-Linux/Issues/"},{"name":"Personal Records","slug":"Personal-Records","link":"/categories/Personal-Records/"}]}